{
  "Tiny Friends, 1 Point": " Your party is besieged by cute animals! Small forest critters dart between your legs, 'helping' you work. Whenever you roll a critical success or critical fail this DIY, the amount of animals double. They have no mechanical effect.",
  "Gift From the Sea, 1 Point": "You’ve found a particularly interesting shell! Roll a d2. On a 1, it’s cursed and turns your next nat 20 into a nat 1! On a 2, it’s a gift from the seas, turning your next roll below 5 into a nat 20!",
  "Blushing, 2 Points": "Everyone in their swimwear is too distracting, take a -1 to all rolls this DIY!",
  "Tides, 1 Point": "The tide has come in! Roll a d10 for water temperature, with 1 being icy and 10 being hot from thermal vents! The temperature has no mechanical effect.",
  "Pirates!! 2 Points": "Roll people or persuasion to try and recruit their aid, dc 15! If you beat the DC, you get +2 to all rolls the rest of the DIY! Be careful though, if you roll below a 5 you get a -2 to rolls the rest of the DIY, as they throw sand and rocks at you!",
  "Bones on the Beach?, 1 Points": "You find a set of strange, rune-etched bones on the beach. They don't seem to do much, except curse a random player in the party to only talk in Poems or Haikus!",
  "Aulera’s Favor, 1 Points": "If your party contains a merfolk, each player gets a +1 to rolls for the duration of the DIY! Otherwise, nothing happens.",
  "Heads up!, 2 Points": "You must pass through an active game of beach volleyball! Every time you roll you must also roll an agility to dodge the players and ball, DC 10! If you fail the DC, you take one damage. On a nat 1, you get bonked on the head for 3 damage!",
  "Rogue Wave, 1 Points": " A massive wave comes barreling for your group! You must either dive under or try to get over! Flip a coin, heads for over, tails for under. The players who went the opposite direction the coin flipped take 2 damage.",
  "Oof Ouch, 2 Points": "You’ve stumbled onto a patch of particularly pointy pebbles! All players must either float over the pebbles, or roll a Flat d20 as they cross them. If you roll a 6 or 14 you take 3 damage, and if you roll a nat 1 the pebbles cut your foot! Gain the bleeding 1 status effect! Those with hooves are immune to these effects.",
  "Cold Delights, 1 Points": "A wandering merchant offers a frozen treat to all party members! Everyone rolls a d6. 1: Brainfreeze! -1 to all rolls this DIY. 2-5: Tasty Snack! You may add the result of your d6 to any roll during this DIY. 6: Magical Snack! You gain a +2 to all rolls this DIY.",
  "Reely?, 1 Points": "An Eel has been stranded nearby! Roll animal handling to try and help it get back into the water! Roll a 7, 4, or 1 and it shocks you!",
  "Kelp Me!, 1 Points": "The ground is covered in kelp! Each round, you take a -1 to all rolls, unless you shake off the kelp (DC10 Agility, DC13 Push Through)",
  "Ah Pit, Here We Go Again, 2 Points": "Someone's been searching for treasure and digging pits! Every round, roll an agility check to dodge them, DC8. On a fail, you fall in! It requires a DC15 Body roll to get you out!",
  "Prickly Pineapple, 2 Points": "A random player in the party stumbles into a strange, prickly fruit. It starts to put them to sleep! Each round, they cumulate a -1 to all rolls, until at -10, they fall asleep. This debuff can be cleansed with a DC13 Non-Magical Healing check, or if the target takes 5 damage.",
  "Voices in the Trees!, 2 Points": "You're being followed by some nosy parrots, calling back everything you say! Take a -2 to all Charisma checks, until you scare them off. Scaring the parrots off takes a DC12 Intimidation, or DC13 Persuasion check.",
  "Shanty Time!, 1 Points": "Everyone feels the urge to sing together! Each round, everyone rolls a performance check. Add everyone's performance checks together, and if the total beats 30, then get a +1 to every roll that round!",
  "Boogey Bogey, 1 Points": "Everyone feels the urge to dance together! Each round that you narrate your character dancing, you get a +1 to all rolls.",
  "Stalking Celebrants, 1 Points": "You're being followed by a crowd of celebrants. They don't do anything or say anything, and all run when approached. No mechanical effect.",
  "Krill Me Now, 2 Points": "An odd sensation washes over the group. You may only communicate in ocean and water related puns!",
  "Very Vocabulous, 2 Points": "An odd sensation washes over the group. You may only communicate with alliteration!",
  "Buried Treasure, 1 Points": "A chest, full of gold is found! Roll a d2, on a 1, its full of gold. On a 2, its full of chocolate gold.",
  "Quicksand, 2 Points": "The ground is collapsing, better roll high! Any time you roll below a 3 during this DIY, you get a cumulative -1 to all rolls.",
  "Stop It Now!, 1 Points": "A seagull attempts to build its next on a random party member's head. It has no mechanical effect, but gets really angry if anyone tries to shoo it off.",
  "Psychodelic?!, 1 Points": "A random player in the party catches a wiff of some psychodelic spores. They are only able to roll Mysticism for this DIY. Every single roll in this DIY is now a Mysticism roll. They gain a +15 to Mysticism rolls for the duration of the DIY. For combat, players may only use Mysticism to attack.",
  "Wind Warning!, 2 Points": "The wind's blowing, and high rollers beware! If you roll above an during this DIY, you are knocked off your feet, giving you a -3 to the result of that roll!",
  "Beach-Side Lobotomy, 2 Points": "A random player in the party is temporarily lobotomized by a passing wizard crab! They gain a +1 to all Mind checks, but can only speak in a monotone voice. Their frontal lobe is reaqcuired at the end of the DIY.",
  "Underdressed, 1 Points": "The wind and ocean spray is picking up, and everyone is getting cold! All members receive Chilled 1, unless they find some more clothing to warm up.",
  "Mega-Beach-Side Lobotomy!, 2 Points": "Everyone in the party is temporarily lobotomized by a passing wizard crab! They gain a +1 to all Mind checks, but can only speak in a monotone voice. Their frontal lobe is reaqcuired at the end of the DIY!",
  "Silence, 1 Points": "All players fall deaf for the duration of the DIY.",
  "Crazy? I was Crazy Once, 2 Points": "A random player in the party starts to go crazy. They take a -1 to all rolls for the rest of the DIY. This effect is counteracted by the 'Beachside Lobotomy' Draw.",
  "Hunted, 2 Points": "You're being hunted by something.....big, making everyone paranoid. After 6 rounds, a Wizard Crab! appears, and must be defeated in combat!",
  "Flavorful Draw, 1 Points": "Everyone's hair color is swapped. This lasts for the rest of the DIY.",
  "Wardrobe Shuffle, 1 Points": "Everyone's outfit is magically swapped! Go find and post your new outfit.",
  "We Can't Have Nice Things, 2 Points": "A random magical item of each player in the party goes missing! They find it at the end of the DIY.",
  "King of the Sand!, 1 Points": "You meet a stranger on a throne of coral, who claims to be the King of the Sand! He offers an urchin and a starfish to each member of the party. If you choose the urchin, you receive a +1 to all rolls for the rest of the DIY, but can't crit. If you take the starfish, you receive a -3 to all rolls for the rest of the DIY, but every roll above a 10 counts as a crit.",
  "Auskorian Assistance!, 3 Points": "The Auskor twins have arrived to 'help', in the form of explosive fireworks!! Every round during this DIY, players take 2 damage, doubled for everyone if *any* roll a critical fail during the round.",
  "Drought, 1 Points": "You forgot to pack your water and food. You feel miserable while completing this DIY.",
  "The Stars Smile Down, 1 Points": "The constellations are happy you're here! Rolling a 18 or 19 will instantly turn that roll into a 20.",
  "The Stars Frown Down, 2 Points": "The constellations are unhappy of your presence! Rolling a 2 or 3 will instantly turn that roll into a 1.",
  "The Stars Feel Indifferent, 1 Points": "The constellations have either too simplistic or too complex emotions of your presence to properly emote them in a simple actuator or descriptor. Rolling a 8, 9, 11 or 12 will instantly turn that roll into a 10.",
  "Starstrike!, 1 Points": "A random party member gains the ability to call the wrath of the stars above! Once during this DIY, they may decrease the DC of a roll by 10, as a meteor smacks right through anything giving them trouble.",
  "Rainstorm!, 1 Points": "For some reason, it starts to rain heavily and distractingly upon the party! The rain isn't cold at least! All players must narrate their character splashing in a puddle, then get a +1 to all rolls for the rest of the DIY.",
  "Stylish!, 1 Points": "All players in the party most vote on the most stylish player in the party. That player gets a +1 to all rolls. Solve ties by rolling dice.",
  "Lost..., 2 Points": "Anyone seen the path back to the bonfire? Pause the DIY after 2 rolls. To find your way back, you must roll a DC15 Fieldcraft, Academics or Spirit check. Once a single player in the party has succeeded the roll, you continue the DIY as normal.",
  "Latent Modifier, 0 Points": "Wait until 3 rounds have gone by. Then, use the Draw command again, and replace this Draw with the new Draw.",
  "Doubling Up, 0 Points": "Draw again, replacing this Draw with the new Draw. The effects of the New Draw are doubled.",
  "Tripling Up?!, 0 Points": "Draw again, replacing this Draw with the new Draw. The effects of the New Draw are doubled.",
  "Half the Fun, 0 Points": "Draw again, replacing this Draw with the new Draw. The effects of the New Draw are Halved",
  "Multi-Draw!, 0 Points": "Draw 2 more Draws, and discard this one. You can have 1 more Draw than the maximum this round.",
  "Yeah, No Thanks, 0 Points": "You may pick 1 Draw to discard and replace with a New Draw",
  "Footwear Swap, 1 Points": "Everyone's shoes are swapped for the DIY. Take a -1 to all agility checks, as you try to get used to them.",
  "A clam, 1 Points": "You find a clam.",
  "A barnacle, 1 Points": "You find a barnacle",
  "A coral, 1 Points": "You find a coral",
  "A sea cucumber, 1 Points": "You find a sea cucumber",
  "Animal Adventurist, 1 Points": "If at some point during the DIY event, you have drawn the 'A Clam','A Barnacle','A Coral' and 'A Sea Cucumber' draws, message QM: Noodle for a unique prize. Otherwise, discard this Draw and draw again.",
  "Blessing of Leo, 1 Points": "A random player is filled with a love for nature. They receive a +10 to Animal Handling for the DIY.",
  "Vanguardians, 1 Points": "If your party has a Vanguardian in it, their clunky armor and proud demeanor slows you down. The party receive a -1 to all rolls. Otherwise, the party receive a +1 to all rolls.",
  "Steadfast, 1 Points": "If your party has a Steadfast in it, their theraputic approaches and charismatic pacifism slows you down. The party receive a -1 to all rolls. Otherwise, the party receive a +1 to all rolls.",
  "Feastian, 1 Points": "If your party has a Feastian in it, then- Who are we kidding, your party doesn't have a Feastian in it. The party receive a +1 to all rolls.",
  "Oathbreaker, 1 Points": "If your party has an Oathbreaker in it, their fear of whales and arrogant defiance of gods slows you down. The party receive a -1 to all rolls. Otherwise, the party receive a +1 to all rolls.",
  "Order of the Morning, 1 Points": "If your party has an Order of the Morning in it, they won't shut up about tropical island facts, and it slows you down. The party receive a -1 to all rolls. Otherwise, the party receive a +1 to all rolls.",
  "Neverdawn Network, 1 Points": "If your party has a Neverdawn Agent in it, they keep secrets from the group, and it slows you down. The party receive a -1 to all rolls. Otherwise, the party receive a +1 to all rolls.",
  "Tempestian Influence, 1 Points": "If any of the party's characters were born in Tempestia, they seem familiar with this task. They gain a +2 to all rolls this DIY.",
  "Lanae'tu Influence, 1 Points": "If any of the party's characters were born in Lanae'tu, they seem familiar with this task. They gain a +2 to all rolls this DIY.",
  "Selnatan Influence, 1 Points": "If any of the party's characters were born in Selnata, they seem familiar with this task. They gain a +2 to all rolls this DIY.",
  "Vaylian Influence, 1 Points": "If any of the party's characters were born in Vayle, they seem familiar with this task. They gain a +2 to all rolls this DIY.",
  "Big Hats, 1 Points": "Everyone is given a really big, strange looking hat for the DIY. It has no mechanical effect, but kind of gets in the way.",
  "Funny Hats, 1 Points": "Everyone is given a really wacky, zany looking hat for the DIY. It has no mechanical effect, but kind of gets in the way.",
  "Fedoras, 1 Points": "Everyone receives a fedora for the length of the DIY.",
  "Trenchcoats, 1 Points": "Everyone receives a trenchcoat for the length of the DIY.",
  "Special Draw! Crab Bishop!, 0 Points": "You are confronted by the Crab Bishop, a massive, armored crab!! The Crab Bishop has 40hp, 20 AC, a +15 to attack, and attacks twice per round. At the end of every round it summons 1 'Like 4 Crabs', which stat block is found in the Solstice Bonfire document. Once the Crab Bishop is defeated, message QM: Noodle for a prize.",
  "Special Draw! Preparing the Fire, 0 Points": "You have been invited and asked by a letter in your pocket to prepare and light the fire tonight. To do so, you must prepare yourself with the spiritual energy of the Bonfire. To do this, you must complete 1 of every DIY, ending each with a DC 10 Endurance check. If you successfully do all 3 DIYs, as well as a DC10 endurance check at the end of each, message QM: Noodle for instructions.",
  "Special Draw! Attention of the Spirits! 0 Points": "This Draw is immediately delayed! Message QM: Noodle for more details.",
  "Who Brought a Penguin, x Points": "You find a really lost penguin. It follows your around for the rest of the DIY, listening to your conversation and watching you. At the end of the DIY, this Draw counts for points equal to the amount of 2's, 13's and 17's you rolled."
  
}